kepler-444b/GD_gd32e230c8t6/Source/device/quick_box.c
#include "gd32e23x.h"
#include "quick_box.h"
#include "device_manager.h"
#include "FreeRTOS.h"
#include "timers.h"
#include "../gpio/gpio.h"
#include "../base/debug.h"
#include "../uart/uart.h"
#include "../protocol/protocol.h"
#include "../pwm/pwm.h"
#include "../eventbus/eventbus.h"
#include "../config/config.h"

#if defined QUICK_BOX

#define SCALE_100_TO_500(x) ((x) <= 0 ? 0 : ((x) >= 100 ? 500 : ((x) * 500) / 100))
#define SCALE_5_TO_5000(x)  ((x) <= 0 ? 0 : ((x) >= 5 ? 5000 : ((x) * 5000) / 5))

typedef struct {
    bool key_status;          // 按键状态
    bool led_filck;           // 闪烁
    bool enter_config;        // 进入配置状态
    uint16_t key_long_count;  // 长按计数
    uint32_t led_filck_count; // 闪烁计数

    bool zero_now;
    bool zero_last;
} common_quick_t;
static common_quick_t my_common_quick = {0};

typedef struct
{
    bool tigger_relay;
    bool relay_status;
} tigger_relay_t;
static tigger_relay_t my_tigger_relay[3] = {0};

static gpio_pin_typedef_t relay_pins[3] = {0};

void quick_box_gpio_init(void);
void quick_zero_init(void);
void quick_box_data_cb(valid_data_t *data);
void quick_event_handler(event_type_e event, void *params);
void quick_box_timer(TimerHandle_t xTimer);
void quick_ctrl_led_all(bool status);
void quick_tigger_relay(void);
void quick_led_open(uint8_t scene_num, bool status);

void quick_box_init(void)
{
    APP_PRINTF("quick_box_init\n");
    quick_box_gpio_init();

    app_eventbus_subscribe(quick_event_handler); // 订阅事件总线

    quick_zero_init(); // 初始化零点检测

    // 初始化一个静态定时器,用于检测值
    static StaticTimer_t CheckZeroStaticBuffer;
    static TimerHandle_t CheckZeroTimerHandle = NULL;

    CheckZeroTimerHandle = xTimerCreateStatic(
        "QuickTimer",
        pdMS_TO_TICKS(1),
        pdTRUE,
        NULL,
        quick_box_timer,
        &CheckZeroStaticBuffer);

    if (xTimerStart(CheckZeroTimerHandle, 0) != pdPASS) { // 启动定时器
        APP_ERROR("CheckZeroTimerHandle error");
    }

    gpio_pin_typedef_t led_pins[3] = {PB7, PB6, PB5}; // (led与io口映射)顺序为 led1,led2,led3
    app_pwm_init(led_pins, 3);

    relay_pins[0] = PB13;
    relay_pins[1] = PB14;
    relay_pins[2] = PB15;

    // app_set_pwm_fade(0, 10, 1000);
    // app_set_pwm_fade(1, 10, 1000);
    // app_set_pwm_fade(2, 10, 1000);
    // APP_SET_GPIO(PB13, true);
    // APP_SET_GPIO(PB14, true);
    // APP_SET_GPIO(PB15, true);
}

void quick_box_gpio_init(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);

    gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, GPIO_PIN_0); // KEY
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_1);  // D1
    // gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_2); // D2 调试阶段用作 usart1_tx
    // gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_3); // D3 调试阶段用作 usart1_rx
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_4); // CSN
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_5); // SCK
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_6); // MISO
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_7); // MOSI

    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_0); // LD1
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_1); // LD2
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_2); // CE

    // 3路PWM调光
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_5); // OUT13
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_6); // OUT12
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_7); // OUT11

    gpio_mode_set(GPIOB, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_11);  // DET0 过零点检测
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_13); // OUT9
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_14); // OUT8
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_15); // OUT7
}

void quick_zero_init(void)
{
    // (零点检测对实时性要求高,摒弃轮询方式,采用外部中断触发)

    rcu_periph_clock_enable(RCU_CFGCMP);                           // EXIT 线路与 GPIO 相连接
    syscfg_exti_line_config(EXTI_SOURCE_GPIOB, EXTI_SOURCE_PIN11); // GPIO 配置为外部中断
    exti_init(EXTI_11, EXTI_INTERRUPT, EXTI_TRIG_RISING);          // 上升沿触发
    nvic_irq_enable(EXTI4_15_IRQn, 3);
}

void EXTI4_15_IRQHandler(void)
{
    if (exti_interrupt_flag_get(EXTI_11) != RESET) {
        exti_interrupt_flag_clear(EXTI_11);
        quick_tigger_relay();
    }
}

// 执行场景
void quick_led_open(uint8_t scene_num, bool status)
{
    const quick_ctg_t *temp_cfg = app_get_quick_cfg();
    if (status) {
        for (uint8_t i = 0; i < 3; i++) {
            app_set_pwm_fade(i, SCALE_100_TO_500(temp_cfg->key_packet[scene_num].target[i]), SCALE_5_TO_5000(temp_cfg->speed));
            if (temp_cfg->key_packet[scene_num].target[3 + i] <= 100) {
                my_tigger_relay[i].relay_status = temp_cfg->key_packet[scene_num].target[3 + i];
                my_tigger_relay[i].tigger_relay = true;
            }
        }
    } else {
        for (uint8_t i = 0; i < 3; i++) {
            app_set_pwm_fade(i, 0, SCALE_5_TO_5000(temp_cfg->speed));
            my_tigger_relay[i].relay_status = temp_cfg->key_packet[scene_num].target[3 + i];
            my_tigger_relay[i].tigger_relay = true;
        }
    }
}

// 触发继电器
void quick_tigger_relay(void)
{
    for (uint8_t i = 0; i < 3; i++) {
        if (my_tigger_relay[i].relay_status == true &&
            my_tigger_relay[i].tigger_relay == true) {

            APP_SET_GPIO(relay_pins[i], true);
            my_tigger_relay[i].tigger_relay = false;
        } else if (my_tigger_relay[i].relay_status == false &&
                   my_tigger_relay[i].tigger_relay == true) {

            APP_SET_GPIO(relay_pins[i], false);
            my_tigger_relay[i].tigger_relay = false;
        }
    }
}

void quick_box_data_cb(valid_data_t *data)
{
    APP_PRINTF_BUF("quick_recv", data->data, data->length);
    const quick_ctg_t *temp_cfg = app_get_quick_cfg();

    for (uint8_t i = 0; i < LED_NUMBER_COUNT; i++) { // 匹配按键
        if (temp_cfg->key_packet[i].key_func == data->data[1] &&
            temp_cfg->key_packet[i].key_group == data->data[3] &&
            temp_cfg->key_packet[i].key_area == data->data[6] &&
            temp_cfg->key_packet[i].key_scene == data->data[7] &&
            temp_cfg->key_packet[i].key_perm == data->data[4]) {
            if (temp_cfg->key_packet[i].key_area & 0x10) { // 如果勾选了只开
                quick_led_open(i, true);
            } else {
                quick_led_open(i, data->data[2]);
            }
        }
    }
}

void quick_event_handler(event_type_e event, void *params)
{
    switch (event) {
        case EVENT_ENTER_CONFIG: { // 进入配置模式
            quick_ctrl_led_all(true);
            my_common_quick.enter_config = true;
        } break;
        case EVENT_EXIT_CONFIG: { // 退出配置模式
            quick_ctrl_led_all(false);
            my_common_quick.enter_config = false;
        } break;
        case EVENT_SAVE_SUCCESS:
            my_common_quick.led_filck = true;
            app_load_config();
            break;
        case EVENT_RECEIVE_CMD: {
            valid_data_t *valid_data = (valid_data_t *)params;
            quick_box_data_cb(valid_data);
        } break;
        default:
            return;
    }
}

void quick_box_timer(TimerHandle_t xTimer)
{
    const quick_ctg_t *temp_cfg = app_get_quick_cfg();

    my_common_quick.key_status = APP_GET_GPIO(PA0);

    if (my_common_quick.key_status == false) { // 按键按下
        my_common_quick.key_long_count++;
        if (my_common_quick.key_long_count >= 5000) { // 触发长按
            app_send_cmd(0, 0, 0xF8, 0x00);           // 向上位机发送配置申请
            APP_PRINTF("long_press\n");
            my_common_quick.key_long_count = 0;
        }
    } else {
        my_common_quick.key_long_count = 0;
    }

    if (my_common_quick.led_filck == true) { // 开始闪烁
        my_common_quick.led_filck_count++;
        if (my_common_quick.led_filck_count <= 500) {
            quick_ctrl_led_all(true);
        } else if (my_common_quick.led_filck_count <= 1000) {
            quick_ctrl_led_all(false);
        } else {
            quick_ctrl_led_all(true);
            my_common_quick.led_filck_count = 0; // 重置计数器

            my_common_quick.led_filck = false; // 停止闪烁
        }
    }
}

void quick_ctrl_led_all(bool status)
{
    if (status == true) {
        app_set_pwm_duty(0, 500);
        app_set_pwm_duty(1, 500);
        app_set_pwm_duty(2, 500);
    } else {
        app_set_pwm_duty(0, 0);
        app_set_pwm_duty(1, 0);
        app_set_pwm_duty(2, 0);
    }
}
#endif